Revit 2027 API
ParameterTypeId.RebarSystemNumberOfLinesFrontDirn1 Property
 "Exterior Major Number Of Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemNumberOfLinesFrontDirn1 { get; }
Public Shared ReadOnly Property RebarSystemNumberOfLinesFrontDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemNumberOfLinesFrontDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemNumberOfLinesFrontDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace